'''Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
 пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.'''
g = 9.8
H = []
for t in range(10):
    h = (g * t**2) / 2
    H.append(h)
for i in range(len(H)):
    if i == 2 or i == 3 or i == 4:
        print(f'За {i + 1} секунди відстань,пройдена тілом при вільному падінні складає', H[i], 'метрів')
    else:
        print(f'За {i + 1} секунд відстань,пройдена тілом при вільному падінні складає' , H[i], 'метрів')