'''Знайти суму всіх елементів масиву цілих чисел, які менше середнього арифметичного елементів масиву.
 Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 150 до 300. '''
import random
n = 20
array = [random.randint(150, 300) for i in range(n)]
print('Даний масив:\n', array)
ser_sum = sum(array)/n
print(f'Середня сума всіх елементів:\n {ser_sum}')
sum = 0
for j in array:
    if j < ser_sum:
        sum += j
print(f'Сума всіх елементів масиву цілих чисел, які менше середнього арифметичного елементів масиву {sum}')