'''Лінійний масив містить відомості про кількість опадів, що випали за кожен з 12 місяців одного року.
Складіть програму, що визначає загальну кількість опадів протягом цього року, середньомісячну кількість опадів,
кількість посушливих місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року. '''
array = [int(input(f'Введіть кількість опадів за {i + 1} місяць: '))for i in range(12)]
print('Кількість опадів:\n', ' мм Рт ст, '.join(map(str, array)), end='мм Рт ст\n')
dry_month = filter(lambda x: x < 30, array)
print('Загальна кількість опадів за рік: ', sum(array), '\nСередньомісячна кількість опадів: ', sum(array) / len(array), '\nКількість посушливих місяців:', len(list(dry_month)))