'''Дано одновимірний масив з 10 цілих чисел. Підрахуйте найбільше число однакових чисел, що йдуть підряд в ньому. '''

n2 = int(input("Введіть число: "))

check1 = 0
check2 = 0
for i in range(1,10):
    n1 = int(input("Введіть число: "))
    if n1 == n2:
        check1 += 1
    elif n1 != n2:
        check1 = 0
    if check1 > check2:
        check2 = check1
    n2 = n1
if check2 > 0:
    print(f'Кількість однакових чисел, що йдуть підряд в даному масиві:{check2 + 1}')
else:
    print('Кожне число унікальне')